#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/scroll.h"
#include "game/board/opening.h"
#include "game/board/masu.h"
#include "game/board/branch.h"
#include "game/board/player.h"
#include "game/board/window.h"
#include "game/board/com.h"
#include "game/board/status.h"
#include "game/board/camera.h"
#include "game/board/star.h"
#include "game/board/guide.h"
#include "game/board/coin.h"

#include "game/board/capsule.h"

#include "game/wipe.h"
#include "game/mg/timer.h"

#include "datanum/effect.h"

#include "datanum/w05.h"
#include "messnum/board_w05.h"
#include "messnum/board_capmachine.h"

#define MB5EV_MASU_ROCKET_JET MASU_FLAG_BIT(15)
#define MB5EV_MASU_TAXI_JUMP MASU_FLAG_BIT(14)
#define MB5EV_MASU_TAXI MASU_FLAG_BIT(13)
#define MB5EV_MASU_ROCKET MASU_FLAG_BIT_MULTI(10, 3)
#define MB5EV_MASU_MOVEFAN MASU_FLAG_BIT_MULTI(8, 2)

#define MB5EV_MASU_REEL_R MASU_FLAG_BIT(6)
#define MB5EV_MASU_REEL_L MASU_FLAG_BIT(7)
#define MB5EV_MASU_REEL (MB5EV_MASU_REEL_R|MB5EV_MASU_REEL_L)

#define MB5EV_MASU_DOREMI MASU_FLAG_BIT_MULTI(4, 2)
#define MB5EV_MASU_WARP_JUMP MASU_FLAG_BIT(3)
#define MB5EV_MASU_WARP MASU_FLAG_BIT(2)

#define MB5EV_ROCKET_JET_COIN_MAX 32

typedef struct MB5_Work_s {
    int bgMdlId; //0x00
    int areaBaseMdlId[2]; //0x04
    int bgPillarMdlId; //0x0C
    int startMdlId; //0x10
    int symBaseMdlId; //0x14
    int symMdlId; //0x18
    int rocketPathMdlId[3]; //0x1C
    int launchBMdlId[3]; //0x28
    int rocketMdlId[3]; //0x34
    int launchB2MdlId[4]; //0x40
    int doremiMdlId[3]; //0x50
    int A2KatMdlId[2]; //0x5C
    int taxiMdlId[2]; //0x64
    int autoFanMdlId[2]; //0x6C
    int autoFanJetMdlId[2]; //0x74
    int laserMdlId; //0x7C
    int roboMdlId; //0x80
    int roboArmLMdlId; //0x84
    int roboArmL4MdlId; //0x88
    int roboArmRMdlId; //0x8C
    int roboArmR4MdlId; //0x90
    int roboButtonMdlId; //0x94
    int reelMdlId[3]; //0x98
    int roboLampMdlId[3]; //0xA4
    int RLampMdlId[2]; //0xB0
    int warpA1MdlId[2]; //0xB8
    int warpC2MdlId[2]; //0xC0
    int arrowMdlId[22]; //0xC8
    int warpMdlId[4]; //0x120
    int warpLayerMdlId[4]; //0x130
    int radarBodyMdlId[2]; //0x140
    int treeMdlId[2]; //0x148
    int rocketLightMdlId[2]; //0x150
    int PLampMdlId[2]; //0x158
    int rjetBaseMdlId; //0x160
    int rjetArmMdlId[4]; //0x164
    int rjetArmHookMdlId[4]; //0x174
    int rocketJetMdlId[4]; //0x184
    int taxiPathMdlId[2]; //0x194
    int moveFanMdlId[2]; //0x19C
    int taxi1MdlId[2]; //0x1A4
    int unk1AC[3];
    int taxiRingMdlId[10]; //0x1B8
} MB5_WORK;

typedef struct MB5Ev_RocketJetCoin_s {
    int mdlId; //0x00
    int mode; //0x04
    int time; //0x08
    BOOL enableF; //0x0C
    HuVecF pos; //0x10
    HuVecF rot; //0x1C
    HuVecF scale; //0x28
    HuVecF startPos; //0x34
    HuVecF endPos; //0x40
    int alpha; //0x4C
} MB5EV_ROCKET_JET_COIN;

typedef void (*VoidFunc)(void);
extern const VoidFunc _ctors[];
extern const VoidFunc _dtors[];

extern void ObjectSetup(void);

int _prolog(void) {
    const VoidFunc* ctors = _ctors;
    while (*ctors != 0) {
        (**ctors)();
        ctors++;
    }
    ObjectSetup();
    return 0;
}

void _epilog(void) {
    const VoidFunc* dtors = _dtors;
    while (*dtors != 0) {
        (**dtors)();
        dtors++;
    }
}

static BOOL mb5ev_DoremiF[3] = {};
static int mb5ev_TaxiPlayerPrev = -1;
static float mb5ev_ReelTime[6] = {};
static float mb5ev_RocketJetYRotVel[4] = { 0.2f, -0.2f, -0.2f, 0.2f };
static float mb5ev_RocketJetYRot[4] = { -30, 0, 30, 0 };
static float mb5ev_RocketJetSpeed = 1;
static int mb5ev_RocketJetPlayerPrev = -1;
static int mb5ev_MoveFanPlayerPrev = -1;
static int mb5ev_MoveFanSeNo = MSM_SENO_NONE;
static s16 mb5ev_MoveFanCurrNo = -1;

static int numberFileTbl[] = {
    BOARD_HSF_num0,
    BOARD_HSF_num1,
    BOARD_HSF_num2,
    BOARD_HSF_num3,
    BOARD_HSF_num4,
    BOARD_HSF_num5,
    BOARD_HSF_num6,
    BOARD_HSF_num7,
    BOARD_HSF_num8,
    BOARD_HSF_num9
};

static HuVecF mb5ev_PlayerOfsTbl[CHARNO_MAX] = {
    { 0, 0, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
    { -10, 0, 0 },
    { 0, 0, 0 },
    { 0, -20, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
    { 0, 0, 0 },
};

static HuVecF mb5ev_LaunchB2PosTbl[4] = {
    { -3740, 2305, -3200 },
    { -1525, 2100, -2315 },
    { 2935, 3200, -2695 },
    { 4790, 2730, -2430 }
};

static HuVecF mb5ev_RocketPosTbl[3] = {
    { -1086, 750, -811 },
    { 0, 750, -1185 },
    { 1086, 750, -811 },
};

static HuVecF mb5ev_RoboLampPosTbl[3] = {
    { 1335, 3430, -2929 },
    { 1405.5, 3430, -2999.5 },
    { 1476, 3430, -3070 }
};

static HuVecF mb5ev_RLampPosTbl[2] = {
    { 935, 2960, -2735 },
    { 1665, 2960, -3465 }
};

static HuVecF mb5ev_ArrowPosTbl[22] = {
    { 1000, 325, 2200 },
    { -900, 490, 1265 },
    { 900, 490, 1265 },
    { -2315, 1775, -965 },
    { -4005, 1795, -540 },
    { -3415, 1775, -1915 },
    { -2545, 2100, -2365 },
    { 2380, 2585, -1030 },
    { 2390, 2960, -2300 },
    { 5205, 2755, -1450 },
    { 3415, 2755, -1850 },
    { -1500, 490, -55 },
    { -765, 540, -1025 },
    { 765, 540, -1025 },
    { 1500, 490, -55 },
    { -5420, 1900, -2190 },
    { -4400, 2240, -2865 },
    { -2270, 2330, -3425 },
    { 1100, 2960, -2395 },
    { 2400, 3200, -3505 },
    { 4480, 3200, -3475 },
    { -3300, 2305, -3075 }
};

static HuVecF mb5ev_ArrowRotTbl[22] = {
    { 0, 0, 0 },
    { 0, -45, 0 },
    { 0, 45, 0 },
    { 0, 0, 0 },
    { 0, 45, 0 },
    { 0, 0, 0 },
    { 0, 45, 0 },
    { 0, -25, 0 },
    { 0, 0, 0 },
    { 0, 35, 0 },
    { 0, 0, 0 },
    { 0, -115, 0 },
    { 0, -155, 0 },
    { 0, 155, 0 },
    { 0, 115, 0 },
    { 0, -135, 0 },
    { 0, 180, 0 },
    { 0, 180, 0 },
    { 0, -135, 0 },
    { 0, -155, 0 },
    { 0, 180, 0 },
    { 0, 180, 0 }
};

static HuVecF mb5ev_WarpPosTbl[4] = {
    { -1860, 505, 550 },
    { -1990, 1965, -1540 },
    { 1860, 505, 550 },
    { 1785, 2765, -1535 }
};

static HuVecF mb5ev_A2KatPosTbl[2] = {
    { -4825, 1965, -1820 }, 
    { 4615, 2820, -1820 }
};

static HuVecF mb5ev_RadarBodyPosTbl[2] = {
    { -1800, 320, 1390 },
    { 1800, 320, 1390 }
};

static HuVecF mb5ev_RadarBodyRotTbl[2] = {
    { 0, 45, 0 },
    { 0, -45, 0 }
};

static HuVecF mb5ev_TreePosTbl[2] = {
    { -1180, 320, 2000 },
    { 1180, 320, 2000 }
};

static HuVecF mb5ev_TreeRotTbl[2] = {
    { 0, -45, 0 },
    { 0, 45, 0 }
};

static HuVecF mb5ev_RocketLightPosTbl[2] = {
    { -1400, 615, -515 },
    { 1400, 615, -515 }
};

static HuVecF mb5ev_RocketLightRotTbl[2] = {
    { 0, 45, 0 },
    { 0, -45, 0 }
};

static HuVecF mb5ev_WarpA1PosTbl[2] = {
    { -1860, 315, 550 },
    { -1990, 1775, -1540 }
};

static HuVecF mb5ev_WarpC2PosTbl[2] = {
    { 1860, 315, 550 },
    { 1785, 2575, -1535 }
};

static HuVecF mb5ev_PLamp1PosTbl[6] = {
    { -3845, 1875, -1935 },
    { 4135, 2730, -2495 },
    { -3095, 3380, -2610 },
    { -2320, 3380, -3345 },
    { -3055, 3380, -4120 },
    { -3830, 3380, -3385 }
};

static HuVecF mb5ev_Taxi1PosTbl[2] = {
    { -4375, 1965, -1485 },
    { 4165, 2820, -1475 }
};

static HuVecF mb5ev_LaunchBPosTbl[3] = {
    { -800, 700, -525 },
    { 0, 700, -780 },
    { 800, 700, -525 }
};

static HuVecF mb5ev_LaunchBRotTbl[3] = {
    { 0, 45, 0 },
    { 0, 0, 0 },
    { 0, -45, 0 },
};

static HuVecF mb5ev_RoboArm4PosTbl[2] = {
    { 1085, 3305, -2930 },
    { 1474.5, 3305, -3319.5 }
};

static HuVecF mb5ev_TaxiRingPosTbl[10] = {
    { -2400, 3140, -1835 },
    { -1800, 3500, -1835 },
    { -1200, 3800, -1835 },
    { -600, 3985, -1835 },
    { 0, 4045, -1835 },
    { 600, 4070, -1835 },
    { 1200, 4045, -1835 },
    { 1800, 3955, -1835 },
    { 2400, 3775, -1835 },
    { 3000, 3550, -1835 }
};

static MB5_WORK mb5_Work;
static MBMODELID unkMdlId;
static MBMODELID numberMdlId[5];
static HuVecF mb5ev_WarpEndSize;
static unsigned int mb5ev_WarpMasuId;
static int lbl_1_bss_BAC[50];
static unsigned int mb5ev_ReelLMasuId;
static unsigned int mb5ev_ReelRMasuId;
static Mtx mb5ev_RobLArmMtx;
static Mtx mb5ev_RobRArmMtx;
static int mb5ev_RobLArmMdlId;
static int mb5ev_RobRArmMdlId;
static HuVecF mb5ev_RobLArmPos;
static HuVecF mb5ev_RobRArmPos;
static unsigned int mb5ev_DoremiMasuId[3];
static Mtx mb5ev_DoremiMtx[3];
static int mb5ev_DoremiMdlId[3];
static HuVecF mb5ev_DoremiPos[3];
static MB5EV_ROCKET_JET_COIN mb5ev_RocketJetCoin[MB5EV_ROCKET_JET_COIN_MAX];
static int mb5ev_RocketJetCoinTotal;
static ANIMDATA *mb5ev_WarpAnim;
static ANIMDATA *mb5ev_RocketDustAnim;
static HU3DPARMANID mb5ev_WarpParmanId;
static HU3DPARMANID mb5ev_RocketDustParmanId[13];
static BOOL mb5ev_MoveFanResetF;
static BOOL mb5ev_RocketJetResetF;
static BOOL mb5ev_RocketJetCancelF;
static BOOL mb5ev_RocketJetStopF;
static BOOL mb5ev_TaxiResetF;
static BOOL mb5ev_RobRHookF;
static BOOL mb5ev_RobLHookF;
static BOOL lbl_1_bss_10;
static int mb5ev_WarpPathLen;
static BOOL mb5ev_WarpPathEndF;
static BOOL mb5ev_WarpPathValidF;
static OMOBJ *mb5_MainObj;

void MB5_Create(void);
void MB5_Kill(void);
void MB5_LightSet(void);
void MB5_LightReset(void);
int MB5Ev_MasuWalkPre(int playerNo);
int MB5Ev_MasuWalkPost(int playerNo);
int MB5Ev_MasuHatena(int playerNo);
int MB5_MasuPathCheck(s16 id, u32 flag, s16 *linkTbl, BOOL endF);
static void MB5_MainObjUpdate(OMOBJ *obj);

void ObjectSetup(void)
{
    GWPartyFSet(TRUE);
    MBObjectSetup(MBNO_WORLD_5, MB5_Create, MB5_Kill);
}

void MB5_Create(void)
{
    HuVecF openingRot = { -33, 0, 0 };
    HuVecF openingPos = { 416, 1156, -426 };
    HuVecF mapRot = { -78, 0, 0 };
    HuVecF mapPos = { 0, 250, -1180 };
    int boardNo = MBBoardNoGet();
    int i;
    int mdlId;
    for(i=0; i<5; i++) {
        numberMdlId[i] = MBModelCreate(numberFileTbl[i], NULL, FALSE);
        MBModelDispSet(numberMdlId[i], FALSE);
    }
    MBMasuCreate(W05_BIN_masuData);
    MBScrollInit(W05_HSF_scrollCol, 20000, 0);
    MBLightHookSet(MB5_LightSet, MB5_LightReset);
    MBCapsuleColCreate(W05_HSF_capsuleCol);
    mb5_Work.symBaseMdlId = MBModelCreate(W05_HSF_symBase, NULL, FALSE);
    mb5_Work.symMdlId = mdlId = MBModelCreate(W05_HSF_sym, NULL, FALSE);
    MBMotionSpeedSet(mdlId, 1);
    MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    mb5_Work.bgMdlId = MBModelCreate(W05_HSF_bg, NULL, FALSE);
    for(i=0; i<2; i++) {
        mb5_Work.areaBaseMdlId[i] = mdlId = MBModelCreate(W05_HSF_A1Base+i, NULL, FALSE);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    mb5_Work.bgPillarMdlId = mdlId = MBModelCreate(W05_HSF_bgPillar, NULL, FALSE);
    MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    mb5_Work.startMdlId = mdlId = MBModelCreate(W05_HSF_start, NULL, FALSE);
    MBMotionSpeedSet(mdlId, 1);
    MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    for(i=0; i<3; i++) {
        mb5_Work.launchBMdlId[i] = mdlId = MBModelCreate(W05_HSF_launchB, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_LaunchBPosTbl[i]);
        MBModelRotSetV(mdlId, &mb5ev_LaunchBRotTbl[i]);
        MBMotionSpeedSet(mdlId, 0);
    }
    for(i=0; i<3; i++) {
        mb5_Work.rocketPathMdlId[i] = mdlId = MBModelCreate(W05_HSF_rocketPathR+i, NULL, FALSE);
        MBMotionSpeedSet(mdlId, 0);
    }
    for(i=0; i<3; i++) {
        mb5_Work.rocketMdlId[i] = mdlId = MBModelCreate(W05_HSF_rocketR+i, NULL, FALSE);
        MBMotionSpeedSet(mdlId, 0);
        MBModelPosSetV(mdlId, &mb5ev_RocketPosTbl[i]);
    }
    for(i=0; i<4; i++) {
        mb5_Work.launchB2MdlId[i] = mdlId = MBModelCreate(W05_HSF_launchB2, NULL, TRUE);
        MBMotionSpeedSet(mdlId, 0);
        MBModelPosSetV(mdlId, &mb5ev_LaunchB2PosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    MBModelRotSet(mb5_Work.launchB2MdlId[3], 0, 30, 0);
    for(i=0; i<3; i++) {
        mb5_Work.doremiMdlId[i] = mdlId = MBModelCreate(W05_HSF_do+i, NULL, FALSE);
        MBMotionSpeedSet(mdlId, 0);
        MBMotionTimeSet(mdlId, 0);
    }
    for(i=0; i<2; i++) {
        mb5_Work.A2KatMdlId[i] = mdlId = MBModelCreate(W05_HSF_A2kat, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_A2KatPosTbl[i]);
        MBMotionSpeedSet(mdlId, 0);
    }
    MBModelRotSet(mb5_Work.A2KatMdlId[1], 0, 180, 0);
    for(i=0; i<2; i++) {
        mb5_Work.taxiPathMdlId[i] = mdlId = MBModelCreate(W05_HSF_airTaxiPath1+i, NULL, FALSE);
        MBMotionSpeedSet(mdlId, 0);
    }
    for(i=0; i<2; i++) {
        mb5_Work.taxiMdlId[i] = mdlId = MBModelCreate(W05_HSF_airTaxi, NULL, TRUE);
        MBMotionSpeedSet(mdlId, 0);
    }
    for(i=0; i<2; i++) {
        mb5_Work.moveFanMdlId[i] = mdlId = MBModelCreate(W05_HSF_moveFan1+i, NULL, FALSE);
        MBMotionSpeedSet(mdlId, 0);
        MBModelRotSet(mdlId, 0, 0, 0);
        if(i == 0) {
            MBMotionTimeSet(mdlId, 100);
        }
    }
    for(i=0; i<2; i++) {
        mb5_Work.autoFanMdlId[i] = mdlId = MBModelCreate(W05_HSF_autoFan, NULL, TRUE);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<2; i++) {
        mb5_Work.autoFanJetMdlId[i] = mdlId = MBModelCreate(W05_HSF_autoFanJet, NULL, TRUE);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    mb5_Work.laserMdlId = mdlId = MBModelCreate(W05_HSF_laser, NULL, FALSE);
    MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    MBMotionSpeedSet(mdlId, 1);
    MBMotionStartEndSet(mdlId, 2, 20);
    for(i=0; i<2; i++) {
        mb5_Work.warpA1MdlId[i] = mdlId = MBModelCreate(W05_HSF_warpA1, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_WarpA1PosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<2; i++) {
        mb5_Work.warpC2MdlId[i] = mdlId = MBModelCreate(W05_HSF_warpC2, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_WarpC2PosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<4; i++) {
        mb5_Work.warpMdlId[i] = mdlId = MBModelCreate(W05_HSF_warp, NULL, TRUE);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
        MBMotionSpeedSet(mdlId, 1);
        MBModelPosSetV(mdlId, &mb5ev_WarpPosTbl[i]);
        MBModelDispSet(mdlId, FALSE);
    }
    for(i=0; i<4; i++) {
        mb5_Work.warpLayerMdlId[i] = mdlId = MBModelCreate(W05_HSF_warpLayer, NULL, TRUE);
        MBMotionSpeedSet(mdlId, 0);
        MBModelPosSetV(mdlId, &mb5ev_WarpPosTbl[i]);
        MBModelDispSet(mdlId, FALSE);
    }
    mb5_Work.roboMdlId = MBModelCreate(W05_HSF_robo, NULL, FALSE);
    mb5_Work.roboArmLMdlId = mdlId = MBModelCreate(W05_HSF_roboArmL, NULL, FALSE);
    MBMotionSpeedSet(mdlId, 0);
    mb5_Work.roboArmRMdlId = mdlId = MBModelCreate(W05_HSF_roboArmR, NULL, FALSE);
    MBMotionSpeedSet(mdlId, 0);
    mb5_Work.roboArmL4MdlId = mdlId = MBModelCreate(W05_HSF_roboArmR4, NULL, TRUE);
    MBMotionSpeedSet(mdlId, 0);
    MBModelPosSetV(mdlId, &mb5ev_RoboArm4PosTbl[1]);
    mb5_Work.roboArmR4MdlId = mdlId = MBModelCreate(W05_HSF_roboArmR4, NULL, TRUE);
    MBMotionSpeedSet(mdlId, 0);
    MBModelPosSetV(mdlId, &mb5ev_RoboArm4PosTbl[0]);
    mb5_Work.roboButtonMdlId = mdlId = MBModelCreate(W05_HSF_roboButton, NULL, FALSE);
    MBMotionSpeedSet(mdlId, 0);
    for(i=0; i<2; i++) {
        mb5_Work.RLampMdlId[i] = mdlId = MBModelCreate(W05_HSF_rlamp, NULL, TRUE);
        MBMotionSpeedSet(mdlId, 0);
        MBModelPosSetV(mdlId, &mb5ev_RLampPosTbl[i]);
    }
    for(i=0; i<3; i++) {
        mb5_Work.reelMdlId[i] = mdlId = MBModelCreate(W05_HSF_reel1+i, NULL, FALSE);
        MBMotionSpeedSet(mdlId, 0);
        mb5ev_ReelTime[i] = frandmod(8)*20.0f;
        MBMotionTimeSet(mdlId, mb5ev_ReelTime[i]);
    }
    for(i=0; i<3; i++) {
        mb5_Work.roboLampMdlId[i] = mdlId = MBModelCreate(W05_HSF_roboLamp, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_RoboLampPosTbl[i]);
        MBMotionSpeedSet(mdlId, 0);
    }
    for(i=0; i<2; i++) {
        mb5_Work.radarBodyMdlId[i] = mdlId = MBModelCreate(W05_HSF_radarBody, NULL, TRUE);
        MBModelRotSetV(mdlId, &mb5ev_RadarBodyRotTbl[i]);
        MBModelPosSetV(mdlId, &mb5ev_RadarBodyPosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<2; i++) {
        mb5_Work.treeMdlId[i] = mdlId = MBModelCreate(W05_HSF_tree, NULL, TRUE);
        MBModelRotSetV(mdlId, &mb5ev_TreeRotTbl[i]);
        MBModelPosSetV(mdlId, &mb5ev_TreePosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<2; i++) {
        mb5_Work.rocketLightMdlId[i] = mdlId = MBModelCreate(W05_HSF_rocketLight, NULL, TRUE);
        MBModelRotSetV(mdlId, &mb5ev_RocketLightRotTbl[i]);
        MBModelPosSetV(mdlId, &mb5ev_RocketLightPosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<2; i++) {
        mb5_Work.PLampMdlId[i] = mdlId = MBModelCreate(W05_HSF_plamp1, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_PLamp1PosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    mb5_Work.rjetBaseMdlId = mdlId = MBModelCreate(W05_HSF_rjetBase, NULL, FALSE);
    MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    for(i=0; i<4; i++) {
        mb5_Work.rjetArmMdlId[i] = mdlId = MBModelCreate(W05_HSF_rjetArm, NULL, TRUE);
    }
    for(i=0; i<4; i++) {
        mb5_Work.rjetArmHookMdlId[i] = mdlId = MBModelCreate(W05_HSF_rjetArm1Hook+i, NULL, FALSE);
    }
    for(i=0; i<4; i++) {
        if(i%2 == 0) {
            mb5_Work.rocketJetMdlId[i] = mdlId = MBModelCreate(W05_HSF_rjet, NULL, TRUE);
            MBMotionStartEndSet(mdlId, 0, 80);
        } else {
            mb5_Work.rocketJetMdlId[i] = mdlId = MBModelCreate(W05_HSF_coinkar, NULL, TRUE);
        }
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<22; i++) {
        mb5_Work.arrowMdlId[i] = mdlId = MBModelCreate(W05_HSF_arrow1, NULL, TRUE);
        MBModelRotSetV(mdlId, &mb5ev_ArrowRotTbl[i]);
        MBModelPosSetV(mdlId, &mb5ev_ArrowPosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
    }
    for(i=0; i<2; i++) {
        mb5_Work.taxi1MdlId[i] = mdlId = MBModelCreate(W05_HSF_taxi1, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_Taxi1PosTbl[i]);
    }
    MBModelRotSet(mb5_Work.taxi1MdlId[1], 0, 180, 0);
    for(i=0; i<10; i++) {
        mb5_Work.taxiRingMdlId[i] = mdlId = MBModelCreate(W05_HSF_taxiRing, NULL, TRUE);
        MBModelPosSetV(mdlId, &mb5ev_TaxiRingPosTbl[i]);
        MBMotionSpeedSet(mdlId, 1);
        MBModelAttrSet(mdlId, HU3D_MOTATTR_LOOP);
        MBModelDispSet(mdlId, FALSE);
    }
    HuDataDirClose(DATA_w05);
    MBMasuWalkPreHookSet(MB5Ev_MasuWalkPre);
    MBMasuWalkPostHookSet(MB5Ev_MasuWalkPost);
    MBMasuHatenaHookSet(MB5Ev_MasuHatena);
    MBBranchFlagSet(MB5EV_MASU_TAXI_JUMP|MB5EV_MASU_WARP_JUMP);
    MBMasuPathCheckHookSet(MB5_MasuPathCheck);
    MBOpeningViewSet(&openingRot, &openingPos, 22648);
    MBMapViewCameraSet(&mapRot, &mapPos, 24188);
    HuAudSndGrpSetSet(MSM_GRP_BD5);
    mb5_MainObj = MBAddObj(32768, 0, 0, MB5_MainObjUpdate);
}

void MB5_Kill(void)
{
    int i;
    if(unkMdlId >= 0) {
        MBModelKill(unkMdlId);
        unkMdlId = MB_MODEL_NONE;
    }
    for(i=0; i<22; i++) {
        if(mb5_Work.arrowMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.arrowMdlId[i]);
        }
    }
    for(i=0; i<10; i++) {
        if(mb5_Work.taxiRingMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.taxiRingMdlId[i]);
        }
    }
    for(i=0; i<4; i++) {
        if(mb5_Work.warpMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.warpMdlId[i]);
        }
        if(mb5_Work.warpLayerMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.warpLayerMdlId[i]);
        }
        if(mb5_Work.rjetArmMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.rjetArmMdlId[i]);
        }
        if(mb5_Work.rocketJetMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.rocketJetMdlId[i]);
        }
        if(mb5_Work.rjetArmHookMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.rjetArmHookMdlId[i]);
        }
    }
    for(i=0; i<3; i++) {
        if(mb5_Work.doremiMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.doremiMdlId[i]);
        }
        if(mb5_Work.launchBMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.launchBMdlId[i]);
        }
        if(mb5_Work.rocketPathMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.rocketPathMdlId[i]);
        }
        if(mb5_Work.rocketMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.rocketMdlId[i]);
        }
        if(mb5_Work.reelMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.reelMdlId[i]);
        }
        if(mb5_Work.roboLampMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.roboLampMdlId[i]);
        }
    }
    for(i=0; i<2; i++) {
        if(mb5_Work.areaBaseMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.areaBaseMdlId[i]);
        }
        if(mb5_Work.A2KatMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.A2KatMdlId[i]);
        }
        if(mb5_Work.taxiMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.taxiMdlId[i]);
        }
        if(mb5_Work.taxiPathMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.taxiPathMdlId[i]);
        }
        if(mb5_Work.autoFanMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.autoFanMdlId[i]);
        }
        if(mb5_Work.moveFanMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.moveFanMdlId[i]);
        }
        if(mb5_Work.autoFanJetMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.autoFanJetMdlId[i]);
        }
        if(mb5_Work.RLampMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.RLampMdlId[i]);
        }
        if(mb5_Work.warpA1MdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.warpA1MdlId[i]);
        }
        if(mb5_Work.warpC2MdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.warpC2MdlId[i]);
        }
        if(mb5_Work.radarBodyMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.radarBodyMdlId[i]);
        }
        if(mb5_Work.treeMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.treeMdlId[i]);
        }
        if(mb5_Work.rocketLightMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.rocketLightMdlId[i]);
        }
        if(mb5_Work.PLampMdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.PLampMdlId[i]);
        }
        if(mb5_Work.taxi1MdlId[i] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.taxi1MdlId[i]);
        }
    }
    if(mb5_Work.symBaseMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.symBaseMdlId);
    }
    if(mb5_Work.symMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.symMdlId);
    }
    if(mb5_Work.bgMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.bgMdlId);
    }
    if(mb5_Work.bgPillarMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.bgPillarMdlId);
    }
    if(mb5_Work.startMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.startMdlId);
    }
    for(i=0; i<4; i++) {
        if(mb5_Work.launchB2MdlId[0] != MB_MODEL_NONE) {
            MBModelKill(mb5_Work.launchB2MdlId[0]);
        }
    }
    if(mb5_Work.roboMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.roboMdlId);
    }
    if(mb5_Work.roboArmLMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.roboArmLMdlId);
    }
    if(mb5_Work.roboArmRMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.roboArmRMdlId);
    }
    if(mb5_Work.roboArmL4MdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.roboArmL4MdlId);
    }
    if(mb5_Work.roboArmR4MdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.roboArmR4MdlId);
    }
    if(mb5_Work.roboButtonMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.roboButtonMdlId);
    }
    if(mb5_Work.laserMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.laserMdlId);
    }
    if(mb5_Work.rjetBaseMdlId != MB_MODEL_NONE) {
        MBModelKill(mb5_Work.rjetBaseMdlId);
    }
    for(i=0; i<5; i++) {
        if(numberMdlId[i] >= 0) {
            MBModelKill(numberMdlId[i]);
            numberMdlId[i] = MB_MODEL_NONE;
        }
    }
    mb5_MainObj = NULL;
}

static void MB5_MainObjUpdate(OMOBJ *obj)
{
    int i; //r31
    int j; //r30
    int reelPlayerNum; //r29
    int warpPlayerNum; //r28
    int moveFanMdlId; //r27
    int taxiMdlId; //r26
    int rjetBaseMdlId; //r25
   
    float RArm1RotY; //f31
    float mfMotTime; //f30

    
    HuVecF doremiPos[3][GW_PLAYER_MAX]; //0x1F8
    int doremiPlayer[3][GW_PLAYER_MAX]; //0x1C8
    Mtx mfMtx; //0x198
    Mtx taxiMtx; //0x168
    Mtx armMtx; //0x138
    Mtx RJetPMtx; //0x108
    Mtx robArmRotMtx; //0xD8
    HuVecF warpPos[GW_PLAYER_MAX]; //0xA8
    HuVecF reelPos[GW_PLAYER_MAX]; //0x78
    int warpPlayer[GW_PLAYER_MAX]; //0x68
    int reelPlayer[GW_PLAYER_MAX]; //0x58
    int doremiPlayerNum[3]; //0x4C
    int rjetArmHookMdlId[4]; //0x3C
    HuVecF mfRot; //0x30
    HuVecF taxiRot; //0x24
    HuVecF armRot; //0x18
    HuVecF RJetPRot; //0xC
    
    
    static char *doremiHookTbl[3] = {
        "tar1hook",
        "tar2hook",
        "tar3hook"
    };

    static char *moveFanHookTbl[2] = {
        "mfLhook",
        "mfRhook"
    };

    static char *taxiHookTbl[2] = {
        "taxiLhook",
        "taxiRhook"
    };

    static char *armHookTbl[4] = {
        "arm1hook",
        "arm2hook",
        "arm3hook",
        "arm4hook"
    };
    
    MBMotionSpeedSet(mb5_Work.rjetBaseMdlId, mb5ev_RocketJetSpeed);
    for(i=0; i<4; i++) {
        if(i != 0 && i != 2) {
            MBMotionSpeedSet(mb5_Work.rocketJetMdlId[i], mb5ev_RocketJetSpeed);
        }
    }
    rjetBaseMdlId = MBModelIdGet(mb5_Work.rjetBaseMdlId);
    Hu3DModelObjMtxGet(rjetBaseMdlId, "Rjctrhook", RJetPMtx);
    Hu3DMtxRotGet(RJetPMtx, &RJetPRot);
    for(i=0; i<4; i++) {
        if(i != 0 || (i == 0 && !mb5ev_RocketJetStopF)) {
            mb5ev_RocketJetYRot[i] += mb5ev_RocketJetSpeed*mb5ev_RocketJetYRotVel[i];
