#include "game/board/story.h"
#include "game/board/audio.h"
#include "game/board/camera.h"
#include "game/board/window.h"
#include "game/board/player.h"
#include "game/board/masu.h"
#include "game/board/opening.h"
#include "game/board/tutorial.h"
#include "game/board/coin.h"

#include "game/wipe.h"
#include "game/esprite.h"
#include "game/sprite.h"
#include "game/printfunc.h"

#include "game/board/telop.h"
#include "game/board/capsule.h"
#include "game/board/pad.h"

#include "datanum/bdemo.h"
#include "datanum/effect.h"

#include "messnum/board_story.h"
#include "messnum/board_name.h"

static const u32 openingMessTbl[5] = {
    MESS_BOARD_STORY_SCENE0,
    MESS_BOARD_STORY_SCENE1,
    MESS_BOARD_STORY_SCENE2,
    MESS_BOARD_STORY_SCENE3,
    MESS_BOARD_STORY_SCENE4
};

static const int openingMiniKoopaFXTbl[3] = {
    MSM_SE_VOICE_MINIKOOPA+5,
    MSM_SE_VOICE_MINIKOOPAG+5,
    MSM_SE_VOICE_MINIKOOPAB+5
};

static const u32 sceneMessTbl[5] = {
    MESS_BOARD_STORY_SCENE0+8,
    MESS_BOARD_STORY_SCENE1+8,
    MESS_BOARD_STORY_SCENE2+8,
    MESS_BOARD_STORY_SCENE3+8,
    MESS_BOARD_STORY_SCENE4+8
};

static const int sceneMiniKoopaFXTbl[3] = {
    MSM_SE_VOICE_MINIKOOPA+5,
    MSM_SE_VOICE_MINIKOOPAG+5,
    MSM_SE_VOICE_MINIKOOPAB+5
};

static const int scene4MiniKoopaFXTbl[3] = {
    MSM_SE_VOICE_MINIKOOPA+5,
    MSM_SE_VOICE_MINIKOOPAG+5,
    MSM_SE_VOICE_MINIKOOPAB+5
};

static const HuVecF winCameraOfs = { 0, 150, 0 };

static const int miniKoopaGroup1MotTbl[] = {

    StoryObjMotCreate(storyPlayerObj, CHARMOT_HSF_c000m1_485, HU3D_MOTATTR_NONE, FALSE);
    while(!StoryObjMotCheck(storyPlayerObj)) {
        HuPrcVSleep();
    }
    StoryObjRotStart(storyKoopaObj, -30, 12, FALSE);
    StoryObjRotStart(storyMiniKoopaObj, -30, 12, FALSE);
    StoryObjMotShiftSet(storyKoopaObj, 12, HU3D_MOTATTR_LOOP, FALSE);
    StoryObjMotShiftSet(storyMiniKoopaObj, 9, HU3D_MOTATTR_LOOP, FALSE);
    MBWinCreate(MBWIN_TYPE_EVENT, MESS_BOARD_STORY_TIE_DREAM, HUWIN_SPEAKER_NONE);
    MBTopWinWait();
    HuPrcSleep(90);
    WipeColorSet(0, 0, 0);
    if(!_CheckFlag(FLAG_BOARD_TUTORIAL) || !MBTutorialExitFlagGet()) {
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 21);
    }
    WipeWait();
    StoryObjRotStartWalk(storyPlayerObj, 0, 1);
    StoryObjMotWait(storyPlayerObj);
    StoryObjKill(storyPlayerObj);
    StoryObjKill(storyKoopaObj);
    StoryObjKill(storyMiniKoopaObj);
}

static void StoryCoinArcExec(MBCOINEFF *effP)
{
    MBCOINEFFDATA *effDataP; //r30
    int i; //r29
    int delay; //r28
    HuVecF playerPos; //sp+0x20
    HuVecF koopaPos; //sp+0x14
    HuVecF dir; //sp+0x8

    static int delayTbl[2][2] = {
        { 20, 8 },
        { -1, -1 }
    };
    
    if(effP->work[0] == FALSE) {
        for(i=0; delayTbl[i][0] >= 0; i++) {
            if(delayTbl[i][0] > effP->count) {
                break;
            }
        }
        if(delayTbl[i][0] < 0) {
            delay = 4;
        } else {
            delay = delayTbl[i][1];
        }
        for(effDataP=effP->data, i=0; i<effP->count; i++, effDataP++) {
            effDataP->dispF = FALSE;
            effDataP->rot.y = frandmod(360);
            effDataP->scale.x = effDataP->scale.y = effDataP->scale.z = 0;
            effDataP->timeHit = 0;
        }
        effP->work[0] = TRUE;
        effP->work[1] = effP->work[2] = delay;
    }
    if(effP->work[3] != 0 && effP->work[1]++ >= effP->work[2]) {
        for(effDataP=effP->data, i=0; i<effP->count; i++, effDataP++) {
            if(effDataP->dispF == FALSE) {
                MBCoinEffDispOn(effP->effNo, i);
                break;
            }
        }
        if(i < effP->count) {
            effP->work[3]--;
            MBPlayerCoinAdd(MBPlayerStoryPlayerGet(), -1);
        }
        effP->work[1] = 0;
    }
    effDataP = effP->data;
    StoryObjPosGet(storyPlayerObj, &playerPos);
    StoryObjPosGet(storyKoopaObj, &koopaPos);
    playerPos.y += 150;
    koopaPos.y += 200;
    VECSubtract(&koopaPos, &playerPos, &dir);
    for(i=0; i<effP->count; i++, effDataP++) {
        if(effDataP->dispF != FALSE) {
            if(effDataP->time > 45u) {
                effDataP->hitF = TRUE;
            } else {
                float t = (effDataP->time++)/45.0f;
                effDataP->pos.x = playerPos.x+(t*dir.x);
                effDataP->pos.y = playerPos.y+(t*dir.y)+((2*HuSin(t*180.0f))*100);
                effDataP->pos.z = playerPos.z+(t*dir.z);
                effDataP->rot.y += 5;
            }
        }
    }
}

typedef struct StoryObjWork_s {
    u8 killF : 1;
    u8 doneF : 1;
    u8 jumpF : 1;
    u8 forceIdle : 1;
    s8 no;
    s8 playerNo; //0x02
    float rotYStart; //0x04
    float rotYDist; //0x08
    s8 mode; //0x0C
    HuVecF basePos; //0x10
    HuVecF rot; //0x1C
    HuVecF vel; //0x28
    s16 motNum; //0x34
    float fallY; //0x38
    s16 time; //0x3C
    s16 maxTime; //0x3E
    int unk40;
    int splitPrev; //0x44
    int splitNum; //0x48
    int rotDelay; //0x4C
    int unk50;
    OMOBJFUNC extModeExec; //0x54
} STORY_OBJ_WORK;

static void StoryObjExec(OMOBJ *obj)
{
    STORY_OBJ_WORK *work; //r30
    int i; //r29
    
    float t; //f31
    float s; //f30
    float rotY; //f29
    
    work = obj->data;
    if(work->killF || MBKillCheck()) {
        MBCapsuleEffHookStoryCall(0, 2, MB_MODEL_NONE);
        MBCapsuleEffHookStoryCall(1, 2, MB_MODEL_NONE);
        if(work->playerNo < 0) {
            for(i=0; i<obj->mdlcnt; i++) {
                if(obj->mdlId[0] > 0) {
                    MBModelKill(obj->mdlId[i]);
                }
                
            }
        } else if(obj->mtncnt) {
            for(i=0; i<obj->mtncnt; i++) {
                if(obj->mtnId[i] >= 0) {
                    MBMotionKill(obj->mdlId[0], obj->mtnId[i]);
                    obj->mtnId[i] = MB_MOT_NONE;
                }
            }
        }
        obj->mdlId[0] = MB_MODEL_NONE;
        omDelObj(HuPrcCurrentGet(), obj);
        return;
    }
    switch(work->mode) {
